yabbas2/wireless_corne/sdkconfig.defaults
# =============================================================================
# wireless_corne - project defaults
#
# Apply with:  idf.py set-target esp32s3 && idf.py build
# These land in sdkconfig (which is gitignored - edit THIS file, not sdkconfig).
# =============================================================================

CONFIG_IDF_TARGET="esp32s3"

# -----------------------------------------------------------------------------
# Console on UART0  --  THIS IS LOAD-BEARING, DO NOT CHANGE
#
# The ESP32-S3's USB-OTG and USB-Serial-JTAG peripherals share GPIO19/GPIO20.
# Only one can be muxed at a time. The moment we bring up USB *host* mode, the
# USB serial console disappears. If the console were left on USB, the device
# would go silent exactly when we need logs.
#
# UART0 default pins on ESP32-S3 are GPIO43 (TX) / GPIO44 (RX), which are
# broken out on the XIAO as D6 / D7 respectively. No pin remap needed.
#
# Wire a USB-UART adapter:  adapter RX <- D6 (GPIO43),  adapter TX -> D7 (GPIO44),
# and GND <-> GND.  115200 8N1.
# -----------------------------------------------------------------------------
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM_0=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
# Explicitly off - see above.
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG is not set
# CONFIG_ESP_CONSOLE_USB_CDC is not set

# Keep the ROM bootloader's own output on UART too, so we can see boot messages
# and panic backtraces on the same wire.
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# -----------------------------------------------------------------------------
# XIAO ESP32-S3 flash / PSRAM
#
# Board is an ESP32-S3R8: 8 MB flash, 8 MB octal PSRAM.
# PSRAM is deliberately left DISABLED - nothing in this project needs it, and
# enabling octal PSRAM adds boot-time failure modes for zero benefit here.
# -----------------------------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# -----------------------------------------------------------------------------
# Timing
#
# 1000 Hz tick so FreeRTOS delays line up with the 1 ms USB polling interval.
# Full 240 MHz because we will eventually run the USB host stack and the BLE
# host concurrently.
# -----------------------------------------------------------------------------
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# -----------------------------------------------------------------------------
# USB Host
#
# QMK exposes several HID interfaces and its report descriptors are large-ish.
# The default control transfer buffer (256 B) can be too small to fetch them in
# one go; 1024 B gives comfortable headroom.
# -----------------------------------------------------------------------------
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=1024

# -----------------------------------------------------------------------------
# Logging
# -----------------------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_BOOTLOADER_LOG_LEVEL_INFO=y

# -----------------------------------------------------------------------------
# Panic behaviour: print a backtrace and halt rather than silently rebooting.
# During bring-up a reboot loop on a UART console is hard to read.
# -----------------------------------------------------------------------------
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
